app/views/welcome/index.html.erb

INSERT INTO `users` (`admin`, `auth_source_id`, `created_on`, `firstname`, `hashed_password`, `identity_url`, `language`, `last_login_on`, `lastname`, `login`, `mail`, `mail_notification`, `salt`, `status`, `type`, `updated_on`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---

$("#country").change(function(){

$.ajax({
            url: '/users_business_locations/select_states',
            type: "POST",
            data: { 'country' : $("#country").val() },
            dataType: "html",
            success: function (data) {

states=data.split("&lt;option value=&quot;").length
document.getElementById('business_location').length=0
var opt = document.createElement("option");
document.getElementById("business_location").options.add(opt);
opt.text = "Please Select"
opt.value = ""
for(i=1;i<parseInt(states);i++)
{
var opt = document.createElement("option")
document.getElementById("business_location").options.add(opt)
state=data.split("&lt;option value=&quot;")[i]
opt.text = state.split("&quot;&gt;")[0]