app/controllers/issues_controller.rb

  def find_issue
    # Issue.visible.find(...) can not be used to redirect user to the login form
    # if the issue actually exists but requires authentication
    @issue = Issue.find(params[:id], :include => [:project, :tracker, :status, :author, :priority, :category])
---
SELECT `projects`.* FROM `projects` WHERE (((projects.status <> 9) AND (projects.is_public = 1)))