app/controllers/issue_statuses_controller.rb

  def index
    respond_to do |format|
      format.html {
        @issue_status_pages, @issue_statuses = paginate :issue_statuses, :per_page => 25, :order => "position"
        render :action => "index", :layout => false if request.xhr?
      }
      format.api {
        @issue_statuses = IssueStatus.all(:order => 'position')
---
SELECT `issue_statuses`.* FROM `issue_statuses` ORDER BY position LIMIT 25 OFFSET 0