app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles` ORDER BY builtin, position LIMIT 25 OFFSET 0
---
  def index
    respond_to do |format|
      format.html {
        @role_pages, @roles = paginate :roles, :per_page => 25, :order => 'builtin, position'
        render :action => "index", :layout => false if request.xhr?
      }
      format.api {
        @roles = Role.givable.all

SELECT `roles`.* FROM `roles` ORDER BY roles.builtin ASC, roles.position ASC
---
  def new
    # Prefills the form with 'Non member' role permissions by default
    @role = Role.new(params[:role] || {:permissions => Role.non_member.permissions})
    if params[:copy].present? && @copy_from = Role.find_by_id(params[:copy])
      @role.copy_from(@copy_from)
    end
    @roles = Role.sorted.all

UPDATE `roles` SET `permissions` = '--- \n- :add_project\n- :edit_project\n- :close_project\n- :select_project_modules\n- :manage_members\n- :manage_versions\n- :manage_categories\n- :view_issues\n- :add_issues\n- :edit_issues\n- :manage_issue_relations\n- :manage_subtasks\n- :add_issue_notes\n- :move_issues\n- :delete_issues\n- :view_issue_watchers\n- :add_issue_watchers\n- :set_issues_private\n- :set_notes_private\n- :view_private_notes\n- :delete_issue_watchers\n- :manage_public_queries\n- :save_queries\n- :view_gantt\n- :view_calendar\n- :log_time\n- :view_time_entries\n- :edit_time_entries\n- :delete_time_entries\n- :manage_news\n- :comment_news\n- :view_documents\n- :manage_documents\n- :view_wiki_pages\n- :export_wiki_pages\n- :view_wiki_edits\n- :edit_wiki_pages\n- :delete_wiki_pages_attachments\n- :protect_wiki_pages\n- :delete_wiki_pages\n- :rename_wiki_pages\n- :add_messages\n- :edit_messages\n- :delete_messages\n- :manage_boards\n- :view_files\n- :manage_files\n- :browse_repository\n- :manage_repository\n- :view_changesets\n- :manage_related_issues\n- :manage_project_activities\n', `position` = 5 WHERE `roles`.`id` = 1
---
  def update
    if request.put? and @role.update_attributes(params[:role])

SELECT `roles`.* FROM `roles` WHERE (1 = 1 AND id != 1) ORDER BY position DESC LIMIT 1
---
  def find_role
    @role = Role.find(params[:id])