app/controllers/trackers_controller.rb

SELECT `trackers`.* FROM `trackers` ORDER BY position LIMIT 10 OFFSET 0
---
  def index
    respond_to do |format|
      format.html {
        @tracker_pages, @trackers = paginate :trackers, :per_page => 10, :order => 'position'
        render :action => "index", :layout => false if request.xhr?
      }
      format.api {
        @trackers = Tracker.sorted.all