app/views/account/register.html.erb

SELECT `custom_fields`.* FROM `custom_fields` WHERE (type = 'UserCustomField') ORDER BY position
---

<% @user.custom_field_values.select {|v| v.editable? || v.required?}.each do |value| %>